Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/pio/pic32cz4010ca91208.h
#define PIN_PD01A_EIC_EXTINT1                      _UINT32_(97)
#define MUX_PD01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PD01A_EIC_EXTINT1                   ((PIN_PD01A_EIC_EXTINT1 << 16) | MUX_PD01A_EIC_EXTINT1)
#define PORT_PD01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PD01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PD01 External Interrupt Line */

#define PIN_PD16A_EIC_EXTINT1                      _UINT32_(112)
#define MUX_PD16A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PD16A_EIC_EXTINT1                   ((PIN_PD16A_EIC_EXTINT1 << 16) | MUX_PD16A_EIC_EXTINT1)
#define PORT_PD16A_EIC_EXTINT1                     (_UINT32_(1) << 16)
#define PIN_PD16A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PD16 External Interrupt Line */

#define PIN_PE01A_EIC_EXTINT1                      _UINT32_(129)
#define MUX_PE01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PE01A_EIC_EXTINT1                   ((PIN_PE01A_EIC_EXTINT1 << 16) | MUX_PE01A_EIC_EXTINT1)
#define PORT_PE01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PE01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PE01 External Interrupt Line */

#define PIN_PF00A_EIC_EXTINT1                      _UINT32_(160)
#define MUX_PF00A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PF00A_EIC_EXTINT1                   ((PIN_PF00A_EIC_EXTINT1 << 16) | MUX_PF00A_EIC_EXTINT1)
#define PORT_PF00A_EIC_EXTINT1                     (_UINT32_(1) << 0)
#define PIN_PF00A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PF00 External Interrupt Line */

#define PIN_PF01A_EIC_EXTINT1                      _UINT32_(161)
#define MUX_PF01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PF01A_EIC_EXTINT1                   ((PIN_PF01A_EIC_EXTINT1 << 16) | MUX_PF01A_EIC_EXTINT1)
#define PORT_PF01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PF01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PF01 External Interrupt Line */

#define PIN_PG01A_EIC_EXTINT1                      _UINT32_(193)
#define MUX_PG01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PG01A_EIC_EXTINT1                   ((PIN_PG01A_EIC_EXTINT1 << 16) | MUX_PG01A_EIC_EXTINT1)
#define PORT_PG01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PG01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PG01 External Interrupt Line */

#define PIN_PA02A_EIC_EXTINT2                      _UINT32_(2) 
#define MUX_PA02A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PA02A_EIC_EXTINT2                   ((PIN_PA02A_EIC_EXTINT2 << 16) | MUX_PA02A_EIC_EXTINT2)
#define PORT_PA02A_EIC_EXTINT2                     (_UINT32_(1) << 2)
#define PIN_PA02A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PA02 External Interrupt Line */

#define PIN_PA18A_EIC_EXTINT2                      _UINT32_(18)
#define MUX_PA18A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PA18A_EIC_EXTINT2                   ((PIN_PA18A_EIC_EXTINT2 << 16) | MUX_PA18A_EIC_EXTINT2)
#define PORT_PA18A_EIC_EXTINT2                     (_UINT32_(1) << 18)
#define PIN_PA18A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PA18 External Interrupt Line */

#define PIN_PB02A_EIC_EXTINT2                      _UINT32_(34)
#define MUX_PB02A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PB02A_EIC_EXTINT2                   ((PIN_PB02A_EIC_EXTINT2 << 16) | MUX_PB02A_EIC_EXTINT2)
#define PORT_PB02A_EIC_EXTINT2                     (_UINT32_(1) << 2)
#define PIN_PB02A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PB02 External Interrupt Line */

#define PIN_PB18A_EIC_EXTINT2                      _UINT32_(50)
#define MUX_PB18A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PB18A_EIC_EXTINT2                   ((PIN_PB18A_EIC_EXTINT2 << 16) | MUX_PB18A_EIC_EXTINT2)
#define PORT_PB18A_EIC_EXTINT2                     (_UINT32_(1) << 18)
#define PIN_PB18A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PB18 External Interrupt Line */

#define PIN_PC18A_EIC_EXTINT2                      _UINT32_(82)
#define MUX_PC18A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PC18A_EIC_EXTINT2                   ((PIN_PC18A_EIC_EXTINT2 << 16) | MUX_PC18A_EIC_EXTINT2)
#define PORT_PC18A_EIC_EXTINT2                     (_UINT32_(1) << 18)
#define PIN_PC18A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PC18 External Interrupt Line */

#define PIN_PD02A_EIC_EXTINT2                      _UINT32_(98)
#define MUX_PD02A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PD02A_EIC_EXTINT2                   ((PIN_PD02A_EIC_EXTINT2 << 16) | MUX_PD02A_EIC_EXTINT2)
#define PORT_PD02A_EIC_EXTINT2                     (_UINT32_(1) << 2)
#define PIN_PD02A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PD02 External Interrupt Line */

#define PIN_PD17A_EIC_EXTINT2                      _UINT32_(113)
#define MUX_PD17A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PD17A_EIC_EXTINT2                   ((PIN_PD17A_EIC_EXTINT2 << 16) | MUX_PD17A_EIC_EXTINT2)
#define PORT_PD17A_EIC_EXTINT2                     (_UINT32_(1) << 17)
#define PIN_PD17A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PD17 External Interrupt Line */

#define PIN_PE02A_EIC_EXTINT2                      _UINT32_(130)
#define MUX_PE02A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PE02A_EIC_EXTINT2                   ((PIN_PE02A_EIC_EXTINT2 << 16) | MUX_PE02A_EIC_EXTINT2)
#define PORT_PE02A_EIC_EXTINT2                     (_UINT32_(1) << 2)
#define PIN_PE02A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PE02 External Interrupt Line */

#define PIN_PF02A_EIC_EXTINT2                      _UINT32_(162)
#define MUX_PF02A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PF02A_EIC_EXTINT2                   ((PIN_PF02A_EIC_EXTINT2 << 16) | MUX_PF02A_EIC_EXTINT2)
#define PORT_PF02A_EIC_EXTINT2                     (_UINT32_(1) << 2)
#define PIN_PF02A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PF02 External Interrupt Line */

