Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/pio/pic32cz4010ca91208.h
#define PIN_PB20A_EIC_EXTINT4                      _UINT32_(52)
#define MUX_PB20A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PB20A_EIC_EXTINT4                   ((PIN_PB20A_EIC_EXTINT4 << 16) | MUX_PB20A_EIC_EXTINT4)
#define PORT_PB20A_EIC_EXTINT4                     (_UINT32_(1) << 20)
#define PIN_PB20A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PB20 External Interrupt Line */

#define PIN_PC04A_EIC_EXTINT4                      _UINT32_(68)
#define MUX_PC04A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PC04A_EIC_EXTINT4                   ((PIN_PC04A_EIC_EXTINT4 << 16) | MUX_PC04A_EIC_EXTINT4)
#define PORT_PC04A_EIC_EXTINT4                     (_UINT32_(1) << 4)
#define PIN_PC04A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PC04 External Interrupt Line */

#define PIN_PD04A_EIC_EXTINT4                      _UINT32_(100)
#define MUX_PD04A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PD04A_EIC_EXTINT4                   ((PIN_PD04A_EIC_EXTINT4 << 16) | MUX_PD04A_EIC_EXTINT4)
#define PORT_PD04A_EIC_EXTINT4                     (_UINT32_(1) << 4)
#define PIN_PD04A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PD04 External Interrupt Line */

#define PIN_PD19A_EIC_EXTINT4                      _UINT32_(115)
#define MUX_PD19A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PD19A_EIC_EXTINT4                   ((PIN_PD19A_EIC_EXTINT4 << 16) | MUX_PD19A_EIC_EXTINT4)
#define PORT_PD19A_EIC_EXTINT4                     (_UINT32_(1) << 19)
#define PIN_PD19A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PD19 External Interrupt Line */

#define PIN_PE04A_EIC_EXTINT4                      _UINT32_(132)
#define MUX_PE04A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PE04A_EIC_EXTINT4                   ((PIN_PE04A_EIC_EXTINT4 << 16) | MUX_PE04A_EIC_EXTINT4)
#define PORT_PE04A_EIC_EXTINT4                     (_UINT32_(1) << 4)
#define PIN_PE04A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PE04 External Interrupt Line */

#define PIN_PF04A_EIC_EXTINT4                      _UINT32_(164)
#define MUX_PF04A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PF04A_EIC_EXTINT4                   ((PIN_PF04A_EIC_EXTINT4 << 16) | MUX_PF04A_EIC_EXTINT4)
#define PORT_PF04A_EIC_EXTINT4                     (_UINT32_(1) << 4)
#define PIN_PF04A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PF04 External Interrupt Line */

#define PIN_PG04A_EIC_EXTINT4                      _UINT32_(196)
#define MUX_PG04A_EIC_EXTINT4                      _UINT32_(0) 
#define PINMUX_PG04A_EIC_EXTINT4                   ((PIN_PG04A_EIC_EXTINT4 << 16) | MUX_PG04A_EIC_EXTINT4)
#define PORT_PG04A_EIC_EXTINT4                     (_UINT32_(1) << 4)
#define PIN_PG04A_EIC_EXTINT_NUM                   _UINT32_(4)  /* EIC signal: PIN_PG04 External Interrupt Line */

#define PIN_PA21A_EIC_EXTINT5                      _UINT32_(21)
#define MUX_PA21A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PA21A_EIC_EXTINT5                   ((PIN_PA21A_EIC_EXTINT5 << 16) | MUX_PA21A_EIC_EXTINT5)
#define PORT_PA21A_EIC_EXTINT5                     (_UINT32_(1) << 21)
#define PIN_PA21A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PA21 External Interrupt Line */

#define PIN_PB05A_EIC_EXTINT5                      _UINT32_(37)
#define MUX_PB05A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PB05A_EIC_EXTINT5                   ((PIN_PB05A_EIC_EXTINT5 << 16) | MUX_PB05A_EIC_EXTINT5)
#define PORT_PB05A_EIC_EXTINT5                     (_UINT32_(1) << 5)
#define PIN_PB05A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PB05 External Interrupt Line */

#define PIN_PB21A_EIC_EXTINT5                      _UINT32_(53)
#define MUX_PB21A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PB21A_EIC_EXTINT5                   ((PIN_PB21A_EIC_EXTINT5 << 16) | MUX_PB21A_EIC_EXTINT5)
#define PORT_PB21A_EIC_EXTINT5                     (_UINT32_(1) << 21)
#define PIN_PB21A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PB21 External Interrupt Line */

#define PIN_PC05A_EIC_EXTINT5                      _UINT32_(69)
#define MUX_PC05A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PC05A_EIC_EXTINT5                   ((PIN_PC05A_EIC_EXTINT5 << 16) | MUX_PC05A_EIC_EXTINT5)
#define PORT_PC05A_EIC_EXTINT5                     (_UINT32_(1) << 5)
#define PIN_PC05A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PC05 External Interrupt Line */

#define PIN_PC21A_EIC_EXTINT5                      _UINT32_(85)
#define MUX_PC21A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PC21A_EIC_EXTINT5                   ((PIN_PC21A_EIC_EXTINT5 << 16) | MUX_PC21A_EIC_EXTINT5)
#define PORT_PC21A_EIC_EXTINT5                     (_UINT32_(1) << 21)
#define PIN_PC21A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PC21 External Interrupt Line */

#define PIN_PD05A_EIC_EXTINT5                      _UINT32_(101)
#define MUX_PD05A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PD05A_EIC_EXTINT5                   ((PIN_PD05A_EIC_EXTINT5 << 16) | MUX_PD05A_EIC_EXTINT5)
#define PORT_PD05A_EIC_EXTINT5                     (_UINT32_(1) << 5)
#define PIN_PD05A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PD05 External Interrupt Line */

#define PIN_PD20A_EIC_EXTINT5                      _UINT32_(116)
#define MUX_PD20A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PD20A_EIC_EXTINT5                   ((PIN_PD20A_EIC_EXTINT5 << 16) | MUX_PD20A_EIC_EXTINT5)
#define PORT_PD20A_EIC_EXTINT5                     (_UINT32_(1) << 20)
#define PIN_PD20A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PD20 External Interrupt Line */

#define PIN_PE05A_EIC_EXTINT5                      _UINT32_(133)
#define MUX_PE05A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PE05A_EIC_EXTINT5                   ((PIN_PE05A_EIC_EXTINT5 << 16) | MUX_PE05A_EIC_EXTINT5)
#define PORT_PE05A_EIC_EXTINT5                     (_UINT32_(1) << 5)
#define PIN_PE05A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PE05 External Interrupt Line */

#define PIN_PF05A_EIC_EXTINT5                      _UINT32_(165)
#define MUX_PF05A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PF05A_EIC_EXTINT5                   ((PIN_PF05A_EIC_EXTINT5 << 16) | MUX_PF05A_EIC_EXTINT5)
#define PORT_PF05A_EIC_EXTINT5                     (_UINT32_(1) << 5)
#define PIN_PF05A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PF05 External Interrupt Line */

#define PIN_PG05A_EIC_EXTINT5                      _UINT32_(197)
#define MUX_PG05A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PG05A_EIC_EXTINT5                   ((PIN_PG05A_EIC_EXTINT5 << 16) | MUX_PG05A_EIC_EXTINT5)
#define PORT_PG05A_EIC_EXTINT5                     (_UINT32_(1) << 5)
#define PIN_PG05A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PG05 External Interrupt Line */

#define PIN_PA06A_EIC_EXTINT6                      _UINT32_(6) 
#define MUX_PA06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PA06A_EIC_EXTINT6                   ((PIN_PA06A_EIC_EXTINT6 << 16) | MUX_PA06A_EIC_EXTINT6)
#define PORT_PA06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PA06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PA06 External Interrupt Line */

#define PIN_PA22A_EIC_EXTINT6                      _UINT32_(22)
#define MUX_PA22A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PA22A_EIC_EXTINT6                   ((PIN_PA22A_EIC_EXTINT6 << 16) | MUX_PA22A_EIC_EXTINT6)
#define PORT_PA22A_EIC_EXTINT6                     (_UINT32_(1) << 22)
#define PIN_PA22A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PA22 External Interrupt Line */

#define PIN_PB06A_EIC_EXTINT6                      _UINT32_(38)
#define MUX_PB06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PB06A_EIC_EXTINT6                   ((PIN_PB06A_EIC_EXTINT6 << 16) | MUX_PB06A_EIC_EXTINT6)
#define PORT_PB06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PB06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PB06 External Interrupt Line */

#define PIN_PB22A_EIC_EXTINT6                      _UINT32_(54)
#define MUX_PB22A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PB22A_EIC_EXTINT6                   ((PIN_PB22A_EIC_EXTINT6 << 16) | MUX_PB22A_EIC_EXTINT6)
#define PORT_PB22A_EIC_EXTINT6                     (_UINT32_(1) << 22)
#define PIN_PB22A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PB22 External Interrupt Line */

#define PIN_PC06A_EIC_EXTINT6                      _UINT32_(70)
#define MUX_PC06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PC06A_EIC_EXTINT6                   ((PIN_PC06A_EIC_EXTINT6 << 16) | MUX_PC06A_EIC_EXTINT6)
#define PORT_PC06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PC06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PC06 External Interrupt Line */

#define PIN_PC22A_EIC_EXTINT6                      _UINT32_(86)
#define MUX_PC22A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PC22A_EIC_EXTINT6                   ((PIN_PC22A_EIC_EXTINT6 << 16) | MUX_PC22A_EIC_EXTINT6)
#define PORT_PC22A_EIC_EXTINT6                     (_UINT32_(1) << 22)
#define PIN_PC22A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PC22 External Interrupt Line */

#define PIN_PD06A_EIC_EXTINT6                      _UINT32_(102)
#define MUX_PD06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PD06A_EIC_EXTINT6                   ((PIN_PD06A_EIC_EXTINT6 << 16) | MUX_PD06A_EIC_EXTINT6)
#define PORT_PD06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PD06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PD06 External Interrupt Line */

#define PIN_PD21A_EIC_EXTINT6                      _UINT32_(117)
#define MUX_PD21A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PD21A_EIC_EXTINT6                   ((PIN_PD21A_EIC_EXTINT6 << 16) | MUX_PD21A_EIC_EXTINT6)
#define PORT_PD21A_EIC_EXTINT6                     (_UINT32_(1) << 21)
#define PIN_PD21A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PD21 External Interrupt Line */

#define PIN_PE06A_EIC_EXTINT6                      _UINT32_(134)
#define MUX_PE06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PE06A_EIC_EXTINT6                   ((PIN_PE06A_EIC_EXTINT6 << 16) | MUX_PE06A_EIC_EXTINT6)
#define PORT_PE06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PE06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PE06 External Interrupt Line */

